#### BuiltInFailures.SlabShapeFailures Members

---

|  |
| --- |
| BuiltInFailures SlabShapeFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures SlabShapeFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | SlabShapeEditFailed | Slab Shape Edit failed. [Description] |
| Public property Static member | SlabShapeEditFailedError | Slab Shape Edit failed. [Description] |
| Public property Static member | SlabShapeFailedNotHorz | The Roof or Floor is no longer horizontal. |
| Public property Static member | SlabShapeFailedNotOnlyLines | The Roof or Floor may only contain straight lines. |
| Public property Static member | SlabShapeFailedTooThin | The Floor or Roof is too thin for its given type. |
| Public property Static member | SlabShapeWarnVerticesCoincident | Some slab shape edit vertices were too close to each other or too close to an edge. |
| Public property Static member | SlabShapeWarnVerticesDeleted | Some slab shape edit vertices were deleted because the Floor or Roof has changed its shape. |
| Public property Static member | SlopedInnerEdge | Inner loops of a footprint sketch may not have slope-defining lines. |
| Public property Static member | SlopeTailInsideSlopeLine | The tails of slope arrows must not lie in interior of slope defining lines. |
| Public property Static member | SlopeZero | Adjusting this Line's Overhang will not affect its height because its slope is zero. |

# See Also

BuiltInFailures SlabShapeFailures Class

Autodesk.Revit.DB Namespace